src/DataProcessors/Обслуживание_Наливайка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Обслуживание_Наливайка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Comment>Текущий объект торгового оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogObject.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСервер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверIPадрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверIPпорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Обслуживание_Наливайка/Forms/Форма/module.bsl
Перем ТаблицаЗадания;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		Предупреждение("Данная обработка открывается только из справочника торгового оборудования!",5);
		Отказ = Истина;
		Возврат;  		
	КонецЕсли;   
	
	// заполнение списка COM, LPT и Ethernet портов
	Для н=1 По 32 Цикл
		ЭлементыФормы.ПортПодключения.СписокВыбора.Добавить(н, "COM"+н);
	КонецЦикла;
	//Для н=1 По 4 Цикл
	//	ЭлементыФормы.ПортПодключения.СписокВыбора.Добавить("LPT"+н);
	//КонецЦикла;
	
	НомерПозиции = 1;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.СерверIPадрес			.Доступность = ИспользоватьСервер;
	ЭлементыФормы.СерверIPпорт			.Доступность = ИспользоватьСервер;
	ЭлементыФормы.НадписьСерверIPадрес	.Доступность = ИспользоватьСервер;
	ЭлементыФормы.НадписьСерверIPпорт	.Доступность = ИспользоватьСервер;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Сохранение параметров и закрытие формы
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	ЗаполнитьЗначенияСвойств(ПараметрыТО,ЭтотОбъект);
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура КнопкаДобавитьПозициюНажатие(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("НомерПозиции", НомерПозиции);
	ПараметрыДействия.Вставить("Количество", 1);
	
	ВыполнитьДействие("ДобавитьПозицию", ПараметрыДействия);
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаУдалитьПозициюНажатие(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("НомерПозиции", НомерПозиции);
	ПараметрыДействия.Вставить("Количество", 1);
	
	ВыполнитьДействие("УдалитьПозицию", ПараметрыДействия);
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаРазрешитьВсеНажатие(Элемент)
	
	ВыполнитьДействие("РазрешитьВсе");
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаЗапретитьВсеНажатие(Элемент)
	
	ВыполнитьДействие("ЗапретитьВсе");
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	Иначе
		Предупреждение("ОК!");
	КонецЕсли;
	
КонецПроцедуры
